In [1]:
import pandas as pd

In [4]:
# загрузка данных из файла
data_0 = pd.read_csv('data/titanic.csv')
data_0.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [5]:
data_0.shape

(891, 15)

In [6]:

data_0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [7]:
# удаление строк или столбцов
df = pd.DataFrame({
    "c0": dict(r0=100, r1=200, r2=300),
    "c1": dict(r1=400, r2=500),
    "c2": dict(r0=600, r2=700),
})
df

     c0     c1     c2
r0  100    NaN  600.0
r1  200  400.0    NaN
r2  300  500.0  700.0

In [9]:
# удаление строк с пустыми значениями
df.dropna()

     c0     c1     c2
r2  300  500.0  700.0

In [12]:
# удаление столбцов с пустыми значениями
df.dropna(axis=1)

     c0
r0  100
r1  200
r2  300

In [18]:
# удаление строк по индексам
df.drop(["r0", "r2"])

     c0     c1  c2
r1  200  400.0 NaN

In [20]:
# удаление столбцов по ключам
# df.drop("c1", axis=1)
df.drop(["c0", "c2"], axis=1)

       c1
r0    NaN
r1  400.0
r2  500.0

- очистка данных

In [21]:
data_0.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [24]:
# удаление не нужных столбцов
data_1 = data_0.drop(['sibsp', 'parch', 'embarked', 'class', 'adult_male', 'deck', 'alive', 'alone'], axis=1)
data_1.head()

   survived  pclass     sex   age     fare    who  embark_town
0         0       3    male  22.0   7.2500    man  Southampton
1         1       1  female  38.0  71.2833  woman    Cherbourg
2         1       3  female  26.0   7.9250  woman  Southampton
3         1       1  female  35.0  53.1000  woman  Southampton
4         0       3    male  35.0   8.0500    man  Southampton

In [25]:
data_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   fare         891 non-null    float64
 5   who          891 non-null    object
 6   embark_town  889 non-null    object
dtypes: float64(2), int64(2), object(3)
memory usage: 48.9+ KB

In [26]:
# замена пустых значений на другое значение
data_1["embark_town"] = data_1["embark_town"].fillna('-')

In [27]:
data_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   fare         891 non-null    float64
 5   who          891 non-null    object
 6   embark_town  891 non-null    object
dtypes: float64(2), int64(2), object(3)
memory usage: 48.9+ KB

In [28]:
# удаление строк с пустыми значениями
data_1 = data_1.dropna()

In [29]:
data_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 714 entries, 0 to 890
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     714 non-null    int64
 1   pclass       714 non-null    int64
 2   sex          714 non-null    object
 3   age          714 non-null    float64
 4   fare         714 non-null    float64
 5   who          714 non-null    object
 6   embark_town  714 non-null    object
dtypes: float64(2), int64(2), object(3)
memory usage: 44.6+ KB

In [33]:
# проверка на дубликаты
data_1.duplicated().sum()

0

In [32]:
# удаление дубликатов 
data_1 = data_1.drop_duplicates()

- анализ данных

In [34]:
data_1.columns

Index(['survived', 'pclass', 'sex', 'age', 'fare', 'who', 'embark_town'], dtype='object')

In [37]:
# сколько выживших
num_surv = data_1['survived'].sum()
num_surv

282

In [38]:
data_1.shape

(672, 7)

In [39]:
# процент выживаемости
num_surv / data_1.shape[0] * 100

41.964285714285715

In [40]:
# минимальный возраст
data_1['age'].min()

0.42

In [41]:
# данные пассажиров с возрастом 0.42
data_1.loc[data_1['age'] == 0.42, :]

     survived  pclass   sex   age    fare    who embark_town
803         1       3  male  0.42  8.5167  child   Cherbourg

In [44]:
# группировка данных
data_1.groupby(['pclass', 'sex'])['survived'].sum()

pclass  sex
1       female    81
        male      40
2       female    63
        male      15
3       female    46
        male      37
Name: survived, dtype: int64